laboratoryyingong/arduino-esp32/libraries/WiFiClientSecure/src/ssl_client.cpp
/* Provide SSL/TLS functions to ESP32 with Arduino IDE
*
* Adapted from the ssl_client1 example of mbedtls.
*
* Original Copyright (C) 2006-2015, ARM Limited, All Rights Reserved, Apache 2.0 License.
* Additions Copyright (C) 2017 Evandro Luis Copercini, Apache 2.0 License.
*/

#include "Arduino.h"
#include <esp32-hal-log.h>
#include <lwip/err.h>
#include <lwip/sockets.h>
#include <lwip/netdb.h>
#include <lwip/sys.h>
#include <lwip/netdb.h>
#include <mbedtls/sha256.h>
#include <mbedtls/oid.h>
#include <algorithm>
#include <string>
#include "ssl_client.h"
#include "esp_crt_bundle.h"
#include "WiFi.h"

#if !defined(MBEDTLS_KEY_EXCHANGE__SOME__PSK_ENABLED) && !defined(MBEDTLS_KEY_EXCHANGE_SOME_PSK_ENABLED)
#  warning "Please call `idf.py menuconfig` then go to Component config -> mbedTLS -> TLS Key Exchange Methods -> Enable pre-shared-key ciphersuites and then check `Enable PSK based cyphersuite modes`. Save and Quit."
#else

const char *pers = "esp32-tls";

static int _handle_error(int err, const char * function, int line)
{
    if(err == -30848){
        return err;
    }
#ifdef MBEDTLS_ERROR_C
    char error_buf[100];
    mbedtls_strerror(err, error_buf, 100);
    log_e("[%s():%d]: (%d) %s", function, line, err, error_buf);
#else
    log_e("[%s():%d]: code %d", function, line, err);
#endif
    return err;
}

#define handle_error(e) _handle_error(e, __FUNCTION__, __LINE__)

/* splashme field diagnostics (see ssl_client.h) */
splashme_tls_diag_t g_splashme_tls_diag = {0, 0, 0, 0, -1, 0, SPLASHME_TLS_NONE};

static const char *const kSplashmeTlsState[] = {
    "HELLO_REQUEST", "CLIENT_HELLO", "SERVER_HELLO", "SERVER_CERT",
    "SERVER_KEY_EXCH", "CERT_REQUEST", "SERVER_HELLO_DONE",
    "CLIENT_CERT", "CLIENT_KEY_EXCH", "CERT_VERIFY",
    "CLI_CHANGE_CIPHER", "CLIENT_FINISHED", "SRV_CHANGE_CIPHER",
    "SERVER_FINISHED", "FLUSH_BUFFERS", "WRAPUP", "OVER",
    "NEW_SESSION_TICKET", "HELLO_VERIFY_SENT"
};

const char *splashme_tls_state_name(int state)
{
    const int n = (int)(sizeof(kSplashmeTlsState) / sizeof(kSplashmeTlsState[0]));
    if (state < 0)
        return "not-started";
    return (state < n) ? kSplashmeTlsState[state] : "?";
}

void ssl_init(sslclient_context *ssl_client)
{
    // reset embedded pointers to zero
    memset(ssl_client, 0, sizeof(sslclient_context));
    mbedtls_ssl_init(&ssl_client->ssl_ctx);
    mbedtls_ssl_config_init(&ssl_client->ssl_conf);
    mbedtls_ctr_drbg_init(&ssl_client->drbg_ctx);
}


int start_ssl_client(sslclient_context *ssl_client, const IPAddress& ip, uint32_t port, const char* hostname, int timeout, const char *rootCABuff, bool useRootCABundle, const char *cli_cert, const char *cli_key, const char *pskIdent, const char *psKey, bool insecure, const char **alpn_protos)
{
    char buf[512];
    int ret, flags;
    int enable = 1;
    log_v("Free internal heap before TLS %u", ESP.getFreeHeap());

    if (rootCABuff == NULL && pskIdent == NULL && psKey == NULL && !insecure && !useRootCABundle) {
        return -1;
    }

    log_v("Starting socket");
    ssl_client->socket = -1;

    // splashme diagnostics: start a fresh record for this attempt.
    unsigned long splashme_attempt_start = millis();
    g_splashme_tls_diag.attempts++;
    g_splashme_tls_diag.tcp_ms = 0;
    g_splashme_tls_diag.handshake_ms = 0;
    g_splashme_tls_diag.stall_ms = 0;
    g_splashme_tls_diag.last_state = -1;
    g_splashme_tls_diag.last_error = 0;
    g_splashme_tls_diag.outcome = SPLASHME_TLS_TCP_FAILED; // until TCP is up

    // splashme IPv6: resolve and connect via getaddrinfo(AF_UNSPEC) so TLS works
    // on IPv4-only, IPv6-only and dual-stack networks alike (lwIP's resolver
    // already falls back A -> AAAA). When the caller passed a pre-resolved IPv4
    // and no hostname, feed the numeric address through the same path.
    char port_str[8];
    snprintf(port_str, sizeof(port_str), "%u", (unsigned)port);
    char ip4_str[16];
    const char *node = hostname;
    if (node == NULL) {
        snprintf(ip4_str, sizeof(ip4_str), "%u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
        node = ip4_str;
    }

    if(timeout <= 0){
        timeout = 30000; // Milli seconds.
    }

    ssl_client->socket_timeout = timeout;

    struct timeval tv;
    tv.tv_sec = timeout / 1000;
    tv.tv_usec = (timeout % 1000) * 1000;

    struct addrinfo hints;
    struct addrinfo *addr_list = NULL;
    memset(&hints, 0, sizeof(hints));
    hints.ai_family = AF_UNSPEC;
    hints.ai_socktype = SOCK_STREAM;
    hints.ai_protocol = IPPROTO_TCP;

    if (lwip_getaddrinfo(node, port_str, &hints, &addr_list) != 0 || addr_list == NULL) {
        log_e("getaddrinfo failed for \"%s\"", node);
        return -1;
    }

    for (struct addrinfo *cur = addr_list; cur != NULL; cur = cur->ai_next) {
        char addr_str[46] = "?";
        if (cur->ai_family == AF_INET)
            inet_ntop(AF_INET, &((struct sockaddr_in *)cur->ai_addr)->sin_addr, addr_str, sizeof(addr_str));
        else if (cur->ai_family == AF_INET6)
            inet_ntop(AF_INET6, &((struct sockaddr_in6 *)cur->ai_addr)->sin6_addr, addr_str, sizeof(addr_str));
        log_i("[TLS] connecting %s -> %s (%s)", node, addr_str,
              (cur->ai_family == AF_INET6) ? "IPv6" : "IPv4");

        ssl_client->socket = lwip_socket(cur->ai_family, cur->ai_socktype, cur->ai_protocol);
        if (ssl_client->socket < 0) {
            log_e("ERROR opening socket (family %d)", cur->ai_family);
            continue;
        }

        fcntl( ssl_client->socket, F_SETFL, fcntl( ssl_client->socket, F_GETFL, 0 ) | O_NONBLOCK );

        fd_set fdset;
        FD_ZERO(&fdset);
        FD_SET(ssl_client->socket, &fdset);

        int res = lwip_connect(ssl_client->socket, cur->ai_addr, cur->ai_addrlen);
        if (res < 0 && errno != EINPROGRESS) {
            log_e("connect on fd %d, errno: %d, \"%s\"", ssl_client->socket, errno, strerror(errno));
            lwip_close(ssl_client->socket);
            ssl_client->socket = -1;
            continue;
        }

        res = select(ssl_client->socket + 1, nullptr, &fdset, nullptr, timeout<0 ? nullptr : &tv);
        if (res < 0) {
            log_e("select on fd %d, errno: %d, \"%s\"", ssl_client->socket, errno, strerror(errno));
            lwip_close(ssl_client->socket);
            ssl_client->socket = -1;
            continue;
        } else if (res == 0) {
            log_i("select returned due to timeout %d ms for fd %d", timeout, ssl_client->socket);
            lwip_close(ssl_client->socket);
            ssl_client->socket = -1;
            continue;
        } else {
            int sockerr;
            socklen_t len = (socklen_t)sizeof(int);
            res = getsockopt(ssl_client->socket, SOL_SOCKET, SO_ERROR, &sockerr, &len);

            if (res < 0 || sockerr != 0) {
                log_e("socket error on fd %d, errno: %d, \"%s\"", ssl_client->socket, sockerr, strerror(sockerr));
                lwip_close(ssl_client->socket);
                ssl_client->socket = -1;
                continue;
            }
        }
        break; // connected
    }
    lwip_freeaddrinfo(addr_list);

