laboratoryyingong/arduino-esp32/libraries/WiFiClientSecure/src/ssl_client.cpp
    mbedtls_ssl_conf_rng(&ssl_client->ssl_conf, mbedtls_ctr_drbg_random, &ssl_client->drbg_ctx);

    if ((ret = mbedtls_ssl_setup(&ssl_client->ssl_ctx, &ssl_client->ssl_conf)) != 0) {
        return handle_error(ret);
    }

    mbedtls_ssl_set_bio(&ssl_client->ssl_ctx, &ssl_client->socket, mbedtls_net_send, mbedtls_net_recv, NULL );

    log_v("Performing the SSL/TLS handshake...");
    unsigned long handshake_start_time=millis();

    // splashme field diagnostics. The handshake is the one phase that can stall
    // for minutes on a marginal link while producing NO output at all - the
    // timeout path below used to simply `return -1`, leaving only a bare
    // "start_ssl_client: -1" with no clue whether TLS was even reached.
    // Tracking the mbedTLS state machine turns "the connect was slow" into
    // "it stalled waiting for X", which distinguishes the real causes:
    //   SERVER_CERTIFICATE  - the ~4KB cert chain is not getting through, i.e.
    //                         the link cannot carry bulk inbound data
    //   CLIENT_KEY_EXCHANGE - our own transmit is not reaching the broker
    //   CLIENT_HELLO        - nothing flows in either direction
    // Only slow states are printed, so a healthy handshake stays a single line.
    const unsigned long kSlowStateMs = 1000; // report a step only if it drags

    int last_state = -1;
    unsigned long last_state_ms = handshake_start_time;

    while ((ret = mbedtls_ssl_handshake(&ssl_client->ssl_ctx)) != 0) {
        if (ret != MBEDTLS_ERR_SSL_WANT_READ && ret != MBEDTLS_ERR_SSL_WANT_WRITE) {
            g_splashme_tls_diag.handshake_ms = millis() - handshake_start_time;
            g_splashme_tls_diag.stall_ms = millis() - last_state_ms;
            g_splashme_tls_diag.last_state = last_state;
            g_splashme_tls_diag.last_error = ret;
            g_splashme_tls_diag.outcome = SPLASHME_TLS_ERROR;
            log_e("[TLS] handshake FAILED in %s after %lums (err -0x%04X)",
                  splashme_tls_state_name(last_state),
                  millis() - handshake_start_time, -ret);
            // splashme: -9984 (X509 verify failed) is ambiguous - print the
            // verify flags so field logs distinguish a real certificate issue
            // (expired / future / not trusted) from an OOM-mapped failure.
            uint32_t vflags = mbedtls_ssl_get_verify_result(&ssl_client->ssl_ctx);
            if (vflags != 0) {
                char vbuf[512];
                mbedtls_x509_crt_verify_info(vbuf, sizeof(vbuf), "  ! ", vflags);
                log_e("[TLS] cert verify flags 0x%08X:\n%s", (unsigned)vflags, vbuf);
            }
            return handle_error(ret);
        }

        int st = ssl_client->ssl_ctx.state;
        if (st != last_state) {
            unsigned long now = millis();
            if (last_state >= 0 && (now - last_state_ms) >= kSlowStateMs)
                log_w("[TLS] slow step: %s took %lums",
                      splashme_tls_state_name(last_state), now - last_state_ms);
            last_state = st;
            last_state_ms = now;
            g_splashme_tls_diag.last_state = st;
        }

        if((millis()-handshake_start_time)>ssl_client->handshake_timeout) {
            g_splashme_tls_diag.handshake_ms = millis() - handshake_start_time;
            g_splashme_tls_diag.stall_ms = millis() - last_state_ms;
            g_splashme_tls_diag.last_state = last_state;
            g_splashme_tls_diag.outcome = SPLASHME_TLS_TIMEOUT;
            log_e("[TLS] handshake TIMEOUT after %lums - stalled in %s for %lums",
                  millis() - handshake_start_time,
                  splashme_tls_state_name(last_state),
                  millis() - last_state_ms);
            return -1;
        }
        vTaskDelay(2);//2 ticks
    }
    g_splashme_tls_diag.handshake_ms = millis() - handshake_start_time;
    g_splashme_tls_diag.last_state = MBEDTLS_SSL_HANDSHAKE_OVER;
    g_splashme_tls_diag.stall_ms = 0;
    g_splashme_tls_diag.last_error = 0;
    g_splashme_tls_diag.outcome = SPLASHME_TLS_OK;
    log_i("[TLS] handshake OK in %lums", millis() - handshake_start_time);


#if defined(MBEDTLS_SSL_MAX_FRAGMENT_LENGTH)
    // splashme: report what the server actually granted - field evidence for
    // whether the MFL negotiation worked against this broker.
    log_i("[TLS] negotiated max frag len in=%u out=%u",
          (unsigned)mbedtls_ssl_get_input_max_frag_len(&ssl_client->ssl_ctx),
          (unsigned)mbedtls_ssl_get_output_max_frag_len(&ssl_client->ssl_ctx));
#endif

    if (cli_cert != NULL && cli_key != NULL) {
        log_d("Protocol is %s Ciphersuite is %s", mbedtls_ssl_get_version(&ssl_client->ssl_ctx), mbedtls_ssl_get_ciphersuite(&ssl_client->ssl_ctx));
        if ((ret = mbedtls_ssl_get_record_expansion(&ssl_client->ssl_ctx)) >= 0) {
            log_d("Record expansion is %d", ret);
        } else {
            log_w("Record expansion is unknown (compression)");
        }
    }

    log_v("Verifying peer X.509 certificate...");

    if ((flags = mbedtls_ssl_get_verify_result(&ssl_client->ssl_ctx)) != 0) {
        memset(buf, 0, sizeof(buf));
        mbedtls_x509_crt_verify_info(buf, sizeof(buf), "  ! ", flags);
        log_e("Failed to verify peer certificate! verification info: %s", buf);
        return handle_error(ret);
    } else {
        log_v("Certificate verified.");
    }
    
    if (rootCABuff != NULL) {
        mbedtls_x509_crt_free(&ssl_client->ca_cert);
    }

    if (cli_cert != NULL) {
        mbedtls_x509_crt_free(&ssl_client->client_cert);
    }

    if (cli_key != NULL) {
        mbedtls_pk_free(&ssl_client->client_key);
    }    

    log_v("Free internal heap after TLS %u", ESP.getFreeHeap());

    return ssl_client->socket;
}


void stop_ssl_socket(sslclient_context *ssl_client, const char *rootCABuff, const char *cli_cert, const char *cli_key)
{
    log_v("Cleaning SSL connection.");

    if (ssl_client->socket >= 0) {
        lwip_close(ssl_client->socket);
        ssl_client->socket = -1;
    }

    // avoid memory leak if ssl connection attempt failed
    if (ssl_client->ssl_conf.ca_chain != NULL) {
        mbedtls_x509_crt_free(&ssl_client->ca_cert);
    }
    if (ssl_client->ssl_conf.key_cert != NULL) {
        mbedtls_x509_crt_free(&ssl_client->client_cert);
        mbedtls_pk_free(&ssl_client->client_key);
    }
    mbedtls_ssl_free(&ssl_client->ssl_ctx);
    mbedtls_ssl_config_free(&ssl_client->ssl_conf);
    mbedtls_ctr_drbg_free(&ssl_client->drbg_ctx);
    mbedtls_entropy_free(&ssl_client->entropy_ctx);
    
    // save only interesting fields
    int handshake_timeout = ssl_client->handshake_timeout;
    int socket_timeout = ssl_client->socket_timeout;

    // reset embedded pointers to zero
    memset(ssl_client, 0, sizeof(sslclient_context));
    
    ssl_client->handshake_timeout = handshake_timeout;
    ssl_client->socket_timeout = socket_timeout;
}


int data_to_read(sslclient_context *ssl_client)
{
    int ret, res;
    ret = mbedtls_ssl_read(&ssl_client->ssl_ctx, NULL, 0);
    //log_e("RET: %i",ret);   //for low level debug
    res = mbedtls_ssl_get_bytes_avail(&ssl_client->ssl_ctx);
    //log_e("RES: %i",res);    //for low level debug
    if (ret != MBEDTLS_ERR_SSL_WANT_READ && ret != MBEDTLS_ERR_SSL_WANT_WRITE && ret < 0) {
        return handle_error(ret);
    }

    return res;
}

int send_ssl_data(sslclient_context *ssl_client, const uint8_t *data, size_t len)
{
    log_v("Writing HTTP request with %d bytes...", len); //for low level debug
    int ret = -1;

    unsigned long write_start_time=millis();

    while ((ret = mbedtls_ssl_write(&ssl_client->ssl_ctx, data, len)) <= 0) {
        if((millis()-write_start_time)>ssl_client->socket_timeout) {
            log_v("SSL write timed out.");
            return -1;
        }

        if (ret != MBEDTLS_ERR_SSL_WANT_READ && ret != MBEDTLS_ERR_SSL_WANT_WRITE && ret < 0) {
            log_v("Handling error %d", ret); //for low level debug
            return handle_error(ret);
        }
        
        //wait for space to become available
        vTaskDelay(2);
    }

    return ret;
}

